{
  "concept": "natural_selection",
  "domain": "biology",
  "abstraction_level": 3,
  "corpus": [
    {
      "compression_level": 0.0,
      "text": "survival advantage",
      "probe_question": "What is natural_selection?",
      "expected_keywords": [
        "survival",
        "advantage",
        "adaptation"
      ]
    },
    {
      "compression_level": 0.25,
      "text": "survival advantage passed to offspring",
      "probe_question": "Describe natural_selection briefly",
      "expected_keywords": [
        "survival",
        "advantage",
        "offspring",
        "inheritance"
      ]
    },
    {
      "compression_level": 0.5,
      "text": "Natural selection means individuals with helpful traits survive and reproduce more, passing those traits to offspring. Over time, this shapes populations, helping them adapt to their environment.",
      "probe_question": "Explain natural_selection",
      "expected_keywords": [
        "natural selection",
        "helpful traits",
        "survive",
        "reproduce",
        "adapt",
        "environment"
      ]
    },
    {
      "compression_level": 0.75,
      "text": "Natural selection is a fundamental mechanism of evolution where organisms with advantageous adaptations—such as camouflage or disease resistance—are more likely to survive and reproduce. These beneficial alleles become more common in the gene pool over generations. For example, peppered moths in polluted areas evolved darker coloration for better survival. Natural selection drives speciation and helps populations respond to environmental pressures.",
      "probe_question": "Provide a detailed explanation of natural_selection",
      "expected_keywords": [
        "natural selection",
        "evolution",
        "adaptations",
        "gene pool",
        "alleles",
        "speciation",
        "environmental pressures",
        "survival"
      ]
    },
    {
      "compression_level": 1.0,
      "text": "Natural selection is a fundamental mechanism of evolution in biology, describing the differential survival and reproduction of organisms due to variations in their heritable traits. Individuals possessing advantageous phenotypes—traits that enhance fitness in a given environment—are more likely to survive and reproduce, passing these traits to subsequent generations. Key principles of natural selection include variation (genetic differences among individuals), inheritance (transmission of traits from parents to offspring), differential survival and reproduction (fitness), and adaptation (the process by which populations become better suited to their environment). Over time, natural selection can lead to the evolution of complex adaptations, speciation, and increased biodiversity. Applications of natural selection are evident in fields such as medicine (antibiotic resistance), agriculture (crop improvement), and conservation biology (management of endangered species), where understanding evolutionary dynamics informs practical strategies for addressing biological challenges.",
      "probe_question": "Provide a comprehensive explanation of natural_selection",
      "expected_keywords": [
        "natural selection",
        "evolution",
        "heritable traits",
        "phenotypes",
        "fitness",
        "variation",
        "inheritance",
        "adaptation",
        "speciation",
        "biodiversity",
        "antibiotic resistance",
        "crop improvement"
      ]
    }
  ]
}