{
  "concept": "f_equals_ma",
  "domain": "physics",
  "abstraction_level": 4,
  "corpus": [
    {
      "compression_level": 0.0,
      "text": "force-motion relationship",
      "probe_question": "What is f_equals_ma?",
      "expected_keywords": [
        "force",
        "motion",
        "relationship"
      ]
    },
    {
      "compression_level": 0.25,
      "text": "force causes mass to accelerate",
      "probe_question": "Describe f_equals_ma briefly",
      "expected_keywords": [
        "force",
        "mass",
        "accelerate",
        "cause"
      ]
    },
    {
      "compression_level": 0.5,
      "text": "When a force acts on an object, it causes the object’s mass to accelerate. This relationship helps us predict and understand motion in everyday life and engineering.",
      "probe_question": "Explain f_equals_ma",
      "expected_keywords": [
        "force",
        "object",
        "mass",
        "accelerate",
        "motion",
        "engineering"
      ]
    },
    {
      "compression_level": 0.75,
      "text": "Newton’s second law of motion states that force equals mass times acceleration (F = ma). This means that applying a greater force to an object results in a higher acceleration, assuming mass remains constant. For example, pushing a car requires more force than pushing a bicycle due to their different masses. Engineers use this principle to design vehicles, predict motion, and ensure safety in transportation systems.",
      "probe_question": "Provide a detailed explanation of f_equals_ma",
      "expected_keywords": [
        "newton’s second law",
        "force",
        "mass",
        "acceleration",
        "f = ma",
        "engineers",
        "vehicles",
        "transportation systems"
      ]
    },
    {
      "compression_level": 1.0,
      "text": "In physics, **F = ma** represents Newton’s Second Law of Motion, which states that the net force (**F**) acting on an object is equal to the product of its mass (**m**) and acceleration (**a**). This fundamental equation quantitatively describes how forces influence the motion of objects. The law asserts that acceleration is directly proportional to the net force and inversely proportional to mass, meaning heavier objects require more force to achieve the same acceleration as lighter ones. Key principles include the vector nature of force and acceleration, and the requirement that all forces acting on the object are considered to determine the net force. Applications of F = ma are widespread, including analyzing vehicle dynamics, predicting planetary motion, engineering structures, and understanding everyday phenomena such as walking or driving. This law forms the cornerstone of classical mechanics, enabling precise modeling and prediction of physical systems.",
      "probe_question": "Provide a comprehensive explanation of f_equals_ma",
      "expected_keywords": [
        "newton’s second law",
        "force",
        "mass",
        "acceleration",
        "net force",
        "motion",
        "vector nature",
        "proportionality",
        "classical mechanics",
        "physical systems",
        "applications",
        "prediction"
      ]
    }
  ]
}